name: "CIFAR100_VGGNet_Conv_96_128_256_FC2048"
##################################### data #####################################
layer { 
  name: "data" type: "Data" top: "data" top: "label"
  data_param { backend: LMDB batch_size: 50 shuffle_pool_size: 500
    #source: "/home/hyli/dataset/cifar/cifar100_train_lmdb" }
    #source: "/media/hongyang/research_at_large/Q-dataset/cifar/cifar100_train_lmdb" }
    source: "/data2/dataset/cifar/cifar100_train_lmdb" }
  transform_param { 
    mirror: true
    customize: true
    crop_size: 32
    resize_min: 32
    resize_max: 40
    random_crop: true
    mean_file: "/data2/dataset/cifar/cifar10_mean.binaryproto" } 
    #mean_file: "/home/hyli/dataset/cifar/cifar10_mean.binaryproto" } 
    #mean_file: "/media/hongyang/research_at_large/Q-dataset/cifar/cifar10_mean.binaryproto" }
  include: { phase: TRAIN } 
}

layer { 
  name: "data" type: "Data" top: "data" top: "label"
  data_param { backend: LMDB batch_size: 50
    source: "/data2/dataset/cifar/cifar100_test_lmdb" }
    #source: "/home/hyli/dataset/cifar/cifar100_test_lmdb" }
    #source: "/media/hongyang/research_at_large/Q-dataset/cifar/cifar100_test_lmdb" }
  transform_param { 
    mirror: false
    customize: true
    crop_size: 32
    resize_min: 32
    resize_max: 40
    random_crop: false
    mean_file: "/data2/dataset/cifar/cifar10_mean.binaryproto" } 
    #mean_file: "/home/hyli/dataset/cifar/cifar10_mean.binaryproto" } 
    #mean_file: "/media/hongyang/research_at_large/Q-dataset/cifar/cifar10_mean.binaryproto" }
  include: { phase: TEST } 
}

# ============= conv1-1 bias module =============
layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "conv1_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1_1_bn" type: "BN" bottom: "conv1_1" top: "conv1_1_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu1_1_before" type: "ReLU" bottom: "conv1_1_bn" top: "conv1_1_bn" }
layer { name: "bias1_1_1" type: "Bias" bottom: "conv1_1_bn" top: "bias1_1_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 1 } channel_shared: false } }
layer { name: "bias1_1_2" type: "Bias" bottom: "conv1_1_bn" top: "bias1_1_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.5 } channel_shared: false } }
layer { name: "bias1_1_3" type: "Bias" bottom: "conv1_1_bn" top: "bias1_1_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.5 } channel_shared: false } }  
layer { name: "bias1_1_4" type: "Bias" bottom: "conv1_1_bn" top: "bias1_1_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -1 } channel_shared: false } }
layer { name: "conv1_1_all" type: "Concat" top: "conv1_1_all"
  bottom: "bias1_1_1" bottom: "bias1_1_2" bottom: "bias1_1_3" bottom: "bias1_1_4" }
layer { name: "relu1_1" type: "ReLU" bottom: "conv1_1_all" top: "conv1_1_output" }

# ============= conv1-2 bias module =============
layer { name: "conv1_2" type: "Convolution" bottom: "conv1_1_output" top: "conv1_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1_2_bn" type: "BN" bottom: "conv1_2" top: "conv1_2_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu1_2_before" type: "ReLU" bottom: "conv1_2_bn" top: "conv1_2_bn" }
layer { name: "bias1_2_1" type: "Bias" bottom: "conv1_2_bn" top: "bias1_2_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.3 } channel_shared: false } }
layer { name: "bias1_2_2" type: "Bias" bottom: "conv1_2_bn" top: "bias1_2_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.1 } channel_shared: false } }
layer { name: "bias1_2_3" type: "Bias" bottom: "conv1_2_bn" top: "bias1_2_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.1 } channel_shared: false } }  
layer { name: "bias1_2_4" type: "Bias" bottom: "conv1_2_bn" top: "bias1_2_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.3 } channel_shared: false } }
layer { name: "conv1_2_all" type: "Concat" top: "conv1_2_all"
  bottom: "bias1_2_1" bottom: "bias1_2_2" bottom: "bias1_2_3" bottom: "bias1_2_4" }
layer { name: "relu1_2" type: "ReLU" bottom: "conv1_2_all" top: "conv1_2_output" }

# ============= conv1-3 bias module =============
layer { name: "conv1_3" type: "Convolution" bottom: "conv1_2_output" top: "conv1_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1_3_bn" type: "BN" bottom: "conv1_3" top: "conv1_3_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu1_3_before" type: "ReLU" bottom: "conv1_3_bn" top: "conv1_3_bn" }
layer { name: "bias1_3_1" type: "Bias" bottom: "conv1_3_bn" top: "bias1_3_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "bias1_3_2" type: "Bias" bottom: "conv1_3_bn" top: "bias1_3_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "bias1_3_3" type: "Bias" bottom: "conv1_3_bn" top: "bias1_3_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }  
layer { name: "bias1_3_4" type: "Bias" bottom: "conv1_3_bn" top: "bias1_3_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "conv1_3_all" type: "Concat" top: "conv1_3_all"
  bottom: "bias1_3_1" bottom: "bias1_3_2" bottom: "bias1_3_3" bottom: "bias1_3_4" }
layer { name: "relu1_3" type: "ReLU" bottom: "conv1_3_all" top: "conv1_3_output" }

layer { name: "pool1" type: "Pooling" bottom: "conv1_3_output" top: "pool1"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

# ============= conv2-1 bias module =============
layer { name: "conv2_1" type: "Convolution" bottom: "pool1" top: "conv2_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2_1_bn" type: "BN" bottom: "conv2_1" top: "conv2_1_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu2_1_before" type: "ReLU" bottom: "conv2_1_bn" top: "conv2_1_bn" }
layer { name: "bias2_1_1" type: "Bias" bottom: "conv2_1_bn" top: "bias2_1_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 1 } channel_shared: false } }
layer { name: "bias2_1_2" type: "Bias" bottom: "conv2_1_bn" top: "bias2_1_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.5 } channel_shared: false } }
layer { name: "bias2_1_3" type: "Bias" bottom: "conv2_1_bn" top: "bias2_1_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.5 } channel_shared: false } }  
layer { name: "bias2_1_4" type: "Bias" bottom: "conv2_1_bn" top: "bias2_1_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -1 } channel_shared: false } }
layer { name: "conv2_1_all" type: "Concat" top: "conv2_1_all"
  bottom: "bias2_1_1" bottom: "bias2_1_2" bottom: "bias2_1_3" bottom: "bias2_1_4" }
layer { name: "relu2_1" type: "ReLU" bottom: "conv2_1_all" top: "conv2_1_output" }

# ============= conv2-2 bias module =============
layer { name: "conv2_2" type: "Convolution" bottom: "conv2_1_output" top: "conv2_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2_2_bn" type: "BN" bottom: "conv2_2" top: "conv2_2_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu2_2_before" type: "ReLU" bottom: "conv2_2_bn" top: "conv2_2_bn" }
layer { name: "bias2_2_1" type: "Bias" bottom: "conv2_2_bn" top: "bias2_2_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.3 } channel_shared: false } }
layer { name: "bias2_2_2" type: "Bias" bottom: "conv2_2_bn" top: "bias2_2_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.1 } channel_shared: false } }
layer { name: "bias2_2_3" type: "Bias" bottom: "conv2_2_bn" top: "bias2_2_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.1 } channel_shared: false } }  
layer { name: "bias2_2_4" type: "Bias" bottom: "conv2_2_bn" top: "bias2_2_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.3 } channel_shared: false } }
layer { name: "conv2_2_all" type: "Concat" top: "conv2_2_all"
  bottom: "bias2_2_1" bottom: "bias2_2_2" bottom: "bias2_2_3" bottom: "bias2_2_4" }
layer { name: "relu2_2" type: "ReLU" bottom: "conv2_2_all" top: "conv2_2_output" }

# ============= conv2-3 bias module =============
layer { name: "conv2_3" type: "Convolution" bottom: "conv2_2_output" top: "conv2_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2_3_bn" type: "BN" bottom: "conv2_3" top: "conv2_3_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu2_3_before" type: "ReLU" bottom: "conv2_3_bn" top: "conv2_3_bn" }
layer { name: "bias2_3_1" type: "Bias" bottom: "conv2_3_bn" top: "bias2_3_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "bias2_3_2" type: "Bias" bottom: "conv2_3_bn" top: "bias2_3_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "bias2_3_3" type: "Bias" bottom: "conv2_3_bn" top: "bias2_3_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }  
layer { name: "bias2_3_4" type: "Bias" bottom: "conv2_3_bn" top: "bias2_3_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "conv2_3_all" type: "Concat" top: "conv2_3_all"
  bottom: "bias2_3_1" bottom: "bias2_3_2" bottom: "bias2_3_3" bottom: "bias2_3_4" }
layer { name: "relu2_3" type: "ReLU" bottom: "conv2_3_all" top: "conv2_3_output" }

layer { name: "pool2" type: "Pooling" bottom: "conv2_3_output" top: "pool2"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }


# ============= conv3-1 bias module =============
layer { name: "conv3_1" type: "Convolution" bottom: "pool2" top: "conv3_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv3_1_bn" type: "BN" bottom: "conv3_1" top: "conv3_1_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu3_1_before" type: "ReLU" bottom: "conv3_1_bn" top: "conv3_1_bn" }
layer { name: "bias3_1_1" type: "Bias" bottom: "conv3_1_bn" top: "bias3_1_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 1 } channel_shared: false } }
layer { name: "bias3_1_2" type: "Bias" bottom: "conv3_1_bn" top: "bias3_1_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.5 } channel_shared: false } }
layer { name: "bias3_1_3" type: "Bias" bottom: "conv3_1_bn" top: "bias3_1_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.5 } channel_shared: false } }  
layer { name: "bias3_1_4" type: "Bias" bottom: "conv3_1_bn" top: "bias3_1_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -1 } channel_shared: false } }
layer { name: "conv3_1_all" type: "Concat" top: "conv3_1_all"
  bottom: "bias3_1_1" bottom: "bias3_1_2" bottom: "bias3_1_3" bottom: "bias3_1_4" }
layer { name: "relu3_1" type: "ReLU" bottom: "conv3_1_all" top: "conv3_1_output" }
#layer { name: "drop_3_1" type: "Dropout" bottom: "conv3_1_output" top: "conv3_1_output"
#  dropout_param { dropout_ratio: 0.4 } }

# ============= conv3-2 bias module =============
layer { name: "conv3_2" type: "Convolution" bottom: "conv3_1_output" top: "conv3_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv3_2_bn" type: "BN" bottom: "conv3_2" top: "conv3_2_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu3_2_before" type: "ReLU" bottom: "conv3_2_bn" top: "conv3_2_bn" }
layer { name: "bias3_2_1" type: "Bias" bottom: "conv3_2_bn" top: "bias3_2_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.3 } channel_shared: false } }
layer { name: "bias3_2_2" type: "Bias" bottom: "conv3_2_bn" top: "bias3_2_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0.1 } channel_shared: false } }
layer { name: "bias3_2_3" type: "Bias" bottom: "conv3_2_bn" top: "bias3_2_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.1 } channel_shared: false } }  
layer { name: "bias3_2_4" type: "Bias" bottom: "conv3_2_bn" top: "bias3_2_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: -0.3 } channel_shared: false } }
layer { name: "conv3_2_all" type: "Concat" top: "conv3_2_all"
  bottom: "bias3_2_1" bottom: "bias3_2_2" bottom: "bias3_2_3" bottom: "bias3_2_4" }
layer { name: "relu3_2" type: "ReLU" bottom: "conv3_2_all" top: "conv3_2_output" }
#layer { name: "drop_3_2" type: "Dropout" bottom: "conv3_2_output" top: "conv3_2_output"
#  dropout_param { dropout_ratio: 0.4 } }

# ============= conv3-3 bias module =============
layer { name: "conv3_3" type: "Convolution" bottom: "conv3_2_output" top: "conv3_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 512 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv3_3_bn" type: "BN" bottom: "conv3_3" top: "conv3_3_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu3_3_before" type: "ReLU" bottom: "conv3_3_bn" top: "conv3_3_bn" }
layer { name: "bias3_3_1" type: "Bias" bottom: "conv3_3_bn" top: "bias3_3_1"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "bias3_3_2" type: "Bias" bottom: "conv3_3_bn" top: "bias3_3_2"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "bias3_3_3" type: "Bias" bottom: "conv3_3_bn" top: "bias3_3_3"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }  
layer { name: "bias3_3_4" type: "Bias" bottom: "conv3_3_bn" top: "bias3_3_4"
  param { lr_mult: 2 decay_mult: 0 }
  bias_param { filler { type: "constant" value: 0 } channel_shared: false } }
layer { name: "conv3_3_all" type: "Concat" top: "conv3_3_all"
  bottom: "bias3_3_1" bottom: "bias3_3_2" bottom: "bias3_3_3" bottom: "bias3_3_4" }
layer { name: "relu3_3" type: "ReLU" bottom: "conv3_3_all" top: "conv3_3_output" }
layer { name: "pool3" type: "Pooling" bottom: "conv3_3_output" top: "pool3"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { 
  name: "fc6" 
  type: "InnerProduct" 
  bottom: "pool3" 
  top: "fc6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 1024
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } } }
    
layer { name: "fc6_bn" type: "BN" bottom: "fc6" top: "fc6_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu6" type: "ReLU" bottom: "fc6_bn" top: "fc6_bn" }
layer { name: "drop6" type: "Dropout" bottom: "fc6_bn" top: "fc6_bn"
  dropout_param { dropout_ratio: 0.5 } 
  include: { phase: TRAIN } }

layer { name: "fc7" type: "InnerProduct" bottom: "fc6_bn" top: "fc7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 2048
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "fc7_bn" type: "BN" bottom: "fc7" top: "fc7_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu7" type: "ReLU" bottom: "fc7_bn" top: "fc7_bn" }
layer { name: "drop7" type: "Dropout" bottom: "fc7_bn" top: "fc7_bn"
  dropout_param { dropout_ratio: 0.5 } 
  include: { phase: TRAIN } }


################################# fc8 loss acc #################################
layer { name: "fc8" 
  type: "InnerProduct" 
  bottom: "fc7_bn" 
  top: "fc8"
  param { 
    lr_mult: 1 
    decay_mult: 1 
  }
  param { 
    lr_mult: 2 
    decay_mult: 0 
  }
  inner_product_param { 
    num_output: 100
    weight_filler { 
      type: "gaussian" 
      std: 0.01 
    }
    bias_filler { 
      type: "constant" 
      value: 0 
    } 
  } 
}
layer { 
  name: "accuracy" 
  type: "Accuracy"
  bottom: "fc8" 
  bottom: "label" 
  top: "accuracy"
  include: { phase: TEST } 
}
layer { 
  name: "loss" 
  type: "SoftmaxWithLoss"
  bottom: "fc8" 
  bottom: "label" 
  top: "loss" 
}
